metadata.vendor_name
metadata.product_log_id
metadata.event_timestamp
metadata.collected_timestamp
metadata.event_type
metadata.url_back_to_product
metadata.description
metadata.product_event_type
metadata.product_name
network.sent_bytes
network.received_bytes
network.direction
network.ip_protocol
network.application_protocol
network.ftp.command
network.email.from
network.email.reply_to
network.email.to
network.email.cc
network.email.bcc
network.email.mail_id
network.email.subject
network.dns.id
network.dns.response
network.dns.opcode
network.dns.authoritative
network.dns.truncated
network.dns.recursion_desired
network.dns.recursion_available
network.dns.response_code
network.dns.question.name
network.dns.question.type
network.dns.question.class
network.answers.name
network.answers.type
network.answers.class
network.answers.ttl
network.answers.data
network.answers.binary_data
network.authority.name
network.authority.type
network.authority.class
network.authority.ttl
network.authority.data
network.authority.binary_data
network.additional.name
network.additional.type
network.additional.class
network.additional.ttl
network.additional.data
network.additional.binary_data
network.dhcp.opcode
network.dhcp.htype
network.dhcp.hlen
network.dhcp.hops
network.dhcp.transaction_id
network.dhcp.seconds
network.dhcp.flags
network.dhcp.ciaddr
network.dhcp.yiaddr
network.dhcp.siaddr
network.dhcp.giaddr
network.dhcp.chaddr
network.dhcp.sname
network.dhcp.file
network.dhcp.options.code
network.dhcp.options.data
network.dhcp.type
network.dhcp.lease_time_seconds
network.dhcp.client_hostname
network.dhcp.client_identifier
network.dhcp.requested_address
network.http.method
network.http.referral_url
network.http.user_agent
network.http.response_code
network.tls
network.smtp
extensions.auth.event_type
extensions.auth.mechanism 
extension.vulns.about *
extension.vulns.description
extension.vulns.scan_start_time
extension.vulns.scan_end_time
extension.vulns.first_round
extension.vulns.last_found
extension.vulns.severity
extension.vulns.severity_details
extension.vulns.cvss_base_score
extension.vulns.cvss_vector
extension.vulns.cvss_version
principal.hostname
principal.asset_id
principal.user.userid
principal.user.user_display_name
principal.user.first_name
principal.user.middle_name
principal.user.last_name
principal.user.groupid
principal.user.windows_sid
principal.user.email_addresses
principal.user.employee_id
principal.user.title
principal.process.pid
principal.process.file.md5
principal.process.file.sha1
principal.process.file.size
principal.process.file.full_path
principal.process.command_line
principal.process.product_specific_process_id
principal.process.parent_process.pid
principal.process.parent_process.file.md5
principal.process.parent_process.file.sha1
principal.process.parent_process.file.size
principal.process.parent_process.file.full_path
principal.process.parent_process.command_line
principal.process.parent_process.product_specific_process_id
principal.ip
principal.port
principal.mac
principal.administrative_domain
principal.namespace
principal.file.sha256
principal.file.md5
principal.file.sha1
principal.file.size
principal.file.full_path
principal.mime_type
principal.file_metadata
principal.email
principal.registry.registry_key
principal.registry.registry_value_name
principal.registry.registry_value_data
principal.application
principal.platform
principal.platform_version
principal.platform_patch_level
principal.location.city
principal.location.state
principal.location.country_or_region
principal.location.name
principal.resource.type
principal.resource.id
principal.resource.name
src.hostname
src.asset_id
src.user.userid
src.user.user_display_name
src.user.first_name
src.user.middle_name
src.user.last_name
src.user.groupid
src.user.windows_sid
src.user.email_addresses
src.user.employee_id
src.user.title
src.process.pid
src.process.file.md5
src.process.file.sha1
src.process.file.size
src.process.file.full_path
src.process.command_line
src.process.product_specific_process_id
src.process.parent_process.pid
src.process.parent_process.file.md5
src.process.parent_process.file.sha1
src.process.parent_process.file.size
src.process.parent_process.file.full_path
src.process.parent_process.command_line
src.process.parent_process.product_specific_process_id
src.ip
src.port
src.mac
src.administrative_domain
src.namespace
src.file.sha256
src.file.md5
src.file.sha1
src.file.size
src.file.full_path
src.mime_type
src.file_metadata
src.email
src.registry.registry_key
src.registry.registry_value_name
src.registry.registry_value_data
src.application
src.platform
src.platform_version
src.platform_patch_level
src.location.city
src.location.state
src.location.country_or_region
src.location.name
src.resource.type
src.resource.id
src.resource.name
target.hostname
target.asset_id
target.user.userid
target.user.user_display_name
target.user.first_name
target.user.middle_name
target.user.last_name
target.user.groupid
target.user.windows_sid
target.user.email_addresses
target.user.employee_id
target.user.title
target.process.pid
target.process.file.md5
target.process.file.sha1
target.process.file.size
target.process.file.full_path
target.process.command_line
target.process.product_specific_process_id
target.process.parent_process.pid
target.process.parent_process.file.md5
target.process.parent_process.file.sha1
target.process.parent_process.file.size
target.process.parent_process.file.full_path
target.process.parent_process.command_line
target.process.parent_process.product_specific_process_id
target.ip
target.port
target.mac
target.administrative_domain
target.namespace
target.file.sha256
target.file.md5
target.file.sha1
target.file.size
target.file.full_path
target.mime_type
target.file_metadata
target.email
target.registry.registry_key
target.registry.registry_value_name
target.registry.registry_value_data
target.application
target.platform
target.platform_version
target.platform_patch_level
target.location.city
target.location.state
target.location.country_or_region
target.location.name
target.resource.type
target.resource.id
target.resource.name
intermediary.hostname
intermediary.asset_id
intermediary.user.userid
intermediary.user.user_display_name
intermediary.user.first_name
intermediary.user.middle_name
intermediary.user.last_name
intermediary.user.groupid
intermediary.user.windows_sid
intermediary.user.email_addresses
intermediary.user.employee_id
intermediary.user.title
intermediary.process.pid
intermediary.process.file.md5
intermediary.process.file.sha1
intermediary.process.file.size
intermediary.process.file.full_path
intermediary.process.command_line
intermediary.process.product_specific_process_id
intermediary.process.parent_process.pid
intermediary.process.parent_process.file.md5
intermediary.process.parent_process.file.sha1
intermediary.process.parent_process.file.size
intermediary.process.parent_process.file.full_path
intermediary.process.parent_process.command_line
intermediary.process.parent_process.product_specific_process_id
intermediary.ip
intermediary.port
intermediary.mac
intermediary.administrative_domain
intermediary.namespace
intermediary.file.sha256
intermediary.file.md5
intermediary.file.sha1
intermediary.file.size
intermediary.file.full_path
intermediary.mime_type
intermediary.file_metadata
intermediary.email
intermediary.registry.registry_key
intermediary.registry.registry_value_name
intermediary.registry.registry_value_data
intermediary.application
intermediary.platform
intermediary.platform_version
intermediary.platform_patch_level
intermediary.location.city
intermediary.location.state
intermediary.location.country_or_region
intermediary.location.name
intermediary.resource.type
intermediary.resource.id
intermediary.resource.name
observer.hostname
observer.asset_id
observer.user.userid
observer.user.user_display_name
observer.user.first_name
observer.user.middle_name
observer.user.last_name
observer.user.groupid
observer.user.windows_sid
observer.user.email_addresses
observer.user.employee_id
observer.user.title
observer.process.pid
observer.process.file.md5
observer.process.file.sha1
observer.process.file.size
observer.process.file.full_path
observer.process.command_line
observer.process.product_specific_process_id
observer.process.parent_process.pid
observer.process.parent_process.file.md5
observer.process.parent_process.file.sha1
observer.process.parent_process.file.size
observer.process.parent_process.file.full_path
observer.process.parent_process.command_line
observer.process.parent_process.product_specific_process_id
observer.ip
observer.port
observer.mac
observer.administrative_domain
observer.namespace
observer.file.sha256
observer.file.md5
observer.file.sha1
observer.file.size
observer.file.full_path
observer.mime_type
observer.file_metadata
observer.email
observer.registry.registry_key
observer.registry.registry_value_name
observer.registry.registry_value_data
observer.application
observer.platform
observer.platform_version
observer.platform_patch_level
observer.location.city
observer.location.state
observer.location.country_or_region
observer.location.name
observer.resource.type
observer.resource.id
observer.resource.name
about.hostname
about.asset_id
about.user.userid
about.user.user_display_name
about.user.first_name
about.user.middle_name
about.user.last_name
about.user.groupid
about.user.windows_sid
about.user.email_addresses
about.user.employee_id
about.user.title
about.process.pid
about.process.file.md5
about.process.file.sha1
about.process.file.size
about.process.file.full_path
about.process.command_line
about.process.product_specific_process_id
about.process.parent_process.pid
about.process.parent_process.file.md5
about.process.parent_process.file.sha1
about.process.parent_process.file.size
about.process.parent_process.file.full_path
about.process.parent_process.command_line
about.process.parent_process.product_specific_process_id
about.ip
about.port
about.mac
about.administrative_domain
about.namespace
about.file.sha256
about.file.md5
about.file.sha1
about.file.size
about.file.full_path
about.mime_type
about.file_metadata
about.email
about.registry.registry_key
about.registry.registry_value_name
about.registry.registry_value_data
about.application
about.platform
about.platform_version
about.platform_patch_level
about.location.city
about.location.state
about.location.country_or_region
about.location.name
about.resource.type
about.resource.id
about.resource.name
security_result.about.hostname
security_result.about.asset_id
security_result.about.user.userid
security_result.about.user.user_display_name
security_result.about.user.first_name
security_result.about.user.middle_name
security_result.about.user.last_name
security_result.about.user.groupid
security_result.about.user.windows_sid
security_result.about.user.email_addresses
security_result.about.user.employee_id
security_result.about.user.title
security_result.about.process.pid
security_result.about.process.file.md5
security_result.about.process.file.sha1
security_result.about.process.file.size
security_result.about.process.file.full_path
security_result.about.process.command_line
security_result.about.process.product_specific_process_id
security_result.about.process.parent_process.pid
security_result.about.process.parent_process.file.md5
security_result.about.process.parent_process.file.sha1
security_result.about.process.parent_process.file.size
security_result.about.process.parent_process.file.full_path
security_result.about.process.parent_process.command_line
security_result.about.process.parent_process.product_specific_process_id
security_result.about.ip
security_result.about.port
security_result.about.mac
security_result.about.administrative_domain
security_result.about.namespace
security_result.about.file.sha256
security_result.about.file.md5
security_result.about.file.sha1
security_result.about.file.size
security_result.about.file.full_path
security_result.about.mime_type
security_result.about.file_metadata
security_result.about.email
security_result.about.registry.registry_key
security_result.about.registry.registry_value_name
security_result.about.registry.registry_value_data
security_result.about.application
security_result.about.platform
security_result.about.platform_version
security_result.about.platform_patch_level
security_result.about.location.city
security_result.about.location.state
security_result.about.location.country_or_region
security_result.about.location.name
security_result.about.resource.type
security_result.about.resource.id
security_result.about.resource.name
security_result.category
security_result.threat_name
security_result.rule_id
security_result.rule_name
security_result.summary
security_result.description
security_result.action
security_result.severity
security_result.confidence
security_result.priority
security_result.severity_details
security_result.confidence_details
security_result.priority_details
security_result.url_back_to_product
security_result.category_details
receivetimestamp